In [1]:
import pandas as pd
df = pd.read_csv('dz.csv')

df.head()

    Name    City    Salary
0    Аня   Томск  200000.0
1    Боб  Москва  350000.0
2  Чарли  Москва  270000.0
3   Лиза   Томск   70000.0
4  Настя     NaN   35000.0

In [2]:
group = df.groupby("City")['Salary'].mean()
group

City
Москва    211400.0
Томск      91250.0
Name: Salary, dtype: float64